// TODO: брать из TScheduleObject

export const PLATOON_TYPES = [
    "Офицеры РВСН",
    "Офицеры разведка",
    "Офицеры ВКС",
    "Офицеры ЗИТ",
    "Сержанты МСВ",
];

export const PLATOONS = [
    ["1811", "1812", "1911", "1912", "1701", "1702"],
    ["1801", "1802", "1803", "1901", "1902", "1903", "1703", "1704", "1705"],
    ["1807", "1808", "1809", "1907", "1908", "1909", "1706", "1707", "1708"],
    ["1810", "1910"],
    ["1804", "1805", "1806", "1904", "1905", "1906"],
];

export const SCHEDULE_DATES = [
    [
        "8 января",
        "15 января",
        "22 января",
        "29 января",
        "5 февраля",
        "12 февраля",
        "19 февраля",
        "26 февраля",
        "4 марта",
        "11 марта",
        "18 марта",
        "25 марта",
        "1 апреля",
        "8 апреля",
        "15 апреля",
        "22 апреля",
        "29 апреля",
    ],
    [
        "9 января",
        "16 января",
        "23 января",
        "30 января",
        "6 февраля",
        "13 февраля",
        "20 февраля",
        "27 февраля",
        "5 марта",
        "12 марта",
        "19 марта",
        "26 марта",
        "2 апреля",
        "9 апреля",
        "16 апреля",
        "23 апреля",
        "30 апреля",
    ],
    [
        "10 января",
        "17 января",
        "24 января",
        "31 января",
        "7 февраля",
        "14 февраля",
        "21 февраля",
        "28 февраля",
        "6 марта",
        "13 марта",
        "20 марта",
        "27 марта",
        "3 апреля",
        "10 апреля",
        "17 апреля",
        "24 апреля",
        "1 мая",
    ],
];

export const NEWS_TOPICS = [
    "ВКС",
    "Разведка",
    "РВСН",
    "Внутренняя политика",
    "Внешняя политика",
    "Военные технологии",
    "Информационная безопасность",
];

export const DEFAULT_NUM_OF_ARTICLES = 5;
export const MILITARY_STICKER_ID = "CAADAgADGQADuoh2BvDmu8LdojQmAg";
